# SurfaceRoughness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedGlazing..::..SurfaceRoughness Property
AdvancedGlazing Class See Also
---
The property labeled "Roughness" from the "AdvancedGlazing" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static string SurfaceRoughness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SurfaceRoughness As String
	Get
```

Visual C++
---
```text
public:
static property String^ SurfaceRoughness {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble". This property allows a connected asset.
# See Also
AdvancedGlazing Class
Autodesk.Revit.DB.Visual Namespace